import NuxtLink from './NuxtLink.vue'

export const ua: Partial<I18NData> = {
  meta: {
    title: 'CodeTime - Відстежуйте свій час програмування',
    description: 'CodeTime - це програма, призначена для розробників, яка допоможе вам відстежувати, аналізувати та покращувати свої навички управління часом програмування.',
    ogTitle: 'CodeTime - Відстежуйте свій час програмування',
    ogDescription: 'CodeTime - це програма, призначена для розробників, яка допоможе вам відстежувати, аналізувати та покращувати свої навички управління часом програмування.',
    twitterTitle: 'CodeTime - Відстежуйте свій час програмування',
    twitterDescription: 'CodeTime - це програма, призначена для розробників, яка допоможе вам відстежувати, аналізувати та покращувати свої навички управління часом програмування.',
  },
  general: {
    cancel: 'Скасувати',
    confirm: 'Підтвердити',
  },
  landing: {
    description: 'CodeTime - це програма, призначена для розробників, яка допоможе вам відстежувати та аналізувати свій час програмування.',
    toDashboard: 'Перейти до панелі',
    alreadyStatistical: 'Час програмування вже відстежувався',
    minutes: 'хвилин',
    loginWithGithub: 'Увійти за допомогою GitHub',
    freeMessage: 'Наразі повністю безкоштовно, не потрібна кредитна картка',
    demo: 'Демо',
    features: {
      save: {
        title: 'Зберігайте ваші дані про час програмування назавжди.',
        description: 'Ми знаємо красу історичних даних. Ніщо не є більш розчаровуючим, ніж те, що ваша власна важка праця знищується. Щоб усі користувачі могли переглядати свою історію зростання навіть після багатьох років, ми будемо зберігати ваші дані назавжди, доки ви не знищите їх самостійно, навіть якщо ви ніколи не платили.',
      },
      export: {
        title: 'Підтримка експорту даних.',
        description: 'Найбезпечніше місце у світі - це ваш власний жорсткий диск. Тому ми підтримуємо експорт даних, ви можете вийти в будь-який час і підключитися до інших платформ або власних служб.',
      },
      editor: {
        title: 'Підтримка декількох редакторів.',
        description: 'Ми - дуже мала команда. Це означає, що ми не можемо підтримувати всі IDE або редактори коду. Однак наразі ми підтримуємо IDE серії VSCode та JetBrain. Ми вважаємо, що вони охоплюють більшість потреб користувачів. Ми зробимо все можливе, щоб підтримати більше платформ і забезпечити користь для більшої кількості людей.',
      },
    },
    pricing: {
      title: 'Ціни',
      description: 'Виберіть план, який підходить вам.',
    },
  },
  plan: {
    modal: {
      title: 'Оновити підписку',
      p1: 'Нам потрібна ваша підтримка, щоб зберегти наш ентузіазм розвитку, а також надавати більш багато звітів про дані та кращий користувацький досвід.',
      p2: 'Ви можете вибрати підписку Pro, щоб розблокувати більше функцій.',
      p3: 'Якщо ви зіткнетеся з якими-небудь проблемами під час процесу оплати, будь ласка, зв\'яжіться з нами по електронній пошті.',
    },
    status(str: 'active' | 'cancelled' | 'expired' | 'on-trial' | 'paused' | 'past-due' | 'unpaid') {
      switch (str) {
        case 'active':
          return 'Активний'
        case 'cancelled':
          return 'Скасовано'
        case 'expired':
          return 'Термін дії закінчився'
        case 'on-trial':
          return 'На випробуванні'
        case 'paused':
          return 'Призупинено'
        case 'past-due':
          return 'Закінчився термін дії'
        case 'unpaid':
          return 'Неоплачений'
      }
    },
    basic: {
      title: 'Базовий',
      forever: 'Назавжди',
      features: {
        title: 'Особливості',
        item: {
          saveHistory: 'Збережіть історичні дані назавжди',
          browseRecent: 'Перегляньте дані за останні 90 днів',
          codetimeTrend: 'Звіт про тенденцію часу кодування',
          codetimeLanguaeTrend: 'Звіт про тенденцію мов програмування',
          codetimeProjectTrend: 'Звіт про тенденцію проекту',
          badge: 'Створіть значки для відображення',
          export: 'Експорт даних',
          import: 'Імпорт даних',
          more: 'Інші звіти',
        },
      },
      button: 'Безкоштовно назавжди',
    },
    pro: {
      title: 'Pro',
      preMonth: '/ місяць',
      preYear: '/ рік',
      features: {
        item: {
          include: 'Включає всі функції базового плану',
          browseAll: 'Перегляньте всі історичні дані',
          rule: 'Обробка даних на основі правил',
          tag: 'Система тегів',
        },
      },
      notYet: 'означає ще не доступно',
      button: 'Підписатися зараз',
    },
    needLogin: 'Потрібно увійти',
  },
  dashboard: {
    loginRequired: 'Ласкаво просимо до панелі CodeTime! Будь ласка, увійдіть, щоб переглянути дані часу кодування або натисніть кнопку демо нижче, щоб використати демо панель.',
    pageHeader: {
      title: {
        overview: 'Огляд',
        badge: 'Значки',
        settings: 'Налаштування',
        leaderboard: 'Рейтинг',
      },
      description: {
        overview: 'Перегляньте всі свої дані CodeTime.',
        badge: 'Відображайте свій час кодування у ваших проектах за допомогою зрозумілих, послідовних та чітких значків.',
        settings: 'Керуйте налаштуваннями CodeTime, включаючи вигляд, мову, дані тощо.',
        leaderboard: 'Перегляньте рейтинг CodeTime всіх користувачів.',
      },
    },
    overview: {
      codetimeTrendTitle: 'Тенденція часу кодування',
      codetimeLanguaeTrendTitle: 'Тенденція мов програмування',
      codetimeProjectTrendTitle: 'Тенденція проекту',
      dataRange: {
        title(days: number) {
          return `Останні ${days} днів`
        },
        allTime: 'За весь час',
      },
      statistic: {
        timeTotal: 'Час/Всього',
        timeToday: 'Час/Сьогодні',
        timeAverage: 'Час/Середній',
        longestStreak: 'Стрічка/Найбільша',
        currentStreak: 'Стрічка/Поточна',
      },
      top: {
        language: 'Мова',
        project: 'Проект',
        platform: 'Платформа',
      },
      noData: {
        notice: {
          title: 'Ще немає даних',
          body: defineComponent({
            components: {
              NuxtLink,
            },
            setup() {
              return () => (
                <div class="text-sm">
                  <span class="text-surface-onlow">
                    Наразі ми ще не успішно обробили ваші дані CodeTime. Ця програма підтримується плагіном вашого редактора коду або інтегрованого середовища розробки (наприклад, VSCode, JetBrains IDE). Будь ласка, відвідайте
                  </span>
                  <NuxtLink
                    to="dashboard/settings"
                    class="px-2 text-primary-container"
                  >
                    [ Налаштування ]
                  </NuxtLink>
                  <span class="text-surface-onlow">
                    і налаштуйте необхідні параметри в редакторі коду, який підтримує плагін, який ви використовуєте. Після отримання даних нам потрібно приблизно дві хвилини для їх обробки. Дякуємо за співпрацю.
                  </span>
                </div>
              )
            },
          }),
        },
      },
    },
    badge: {
      preview: {
        title: 'Попередній перегляд',
      },
      style: {
        flat: 'Плаский',
        flatSquare: 'Плаский квадрат',
        forTheBadge: 'For the Badge',
        plastic: 'Пластик',
        social: 'Соціальний',
      },
      placeholder: {
        style: 'Стиль',
        language: 'Мова',
        days: 'Дні',
        project: 'Проект',
        color: 'Колір',
      },
    },
    settings: {
      token: {
        title: 'Токен',
        tip: 'Ваш токен використовується для доступу до API CodeTime. Зберігайте його в таємниці.',
        refresh: 'Оновити',
        refreshTip: 'Якщо ви підозрюєте, що ваш токен став відомий, ви можете згенерувати новий токен тут.',
        refreshToken: 'Оновити токен',
        confirmRefresh: 'Ви впевнені, що хочете оновити токен? Це призведе до недійсності токена, який ви застосували до плагіна редактора. Вам потрібно буде ввести новий токен.',
      },
      language: {
        title: 'Мова',
        tip: 'Виберіть мову для вашого веб-інтерфейсу CodeTime.',
      },
      export: {
        title: 'Експорт',
        button: 'Експорт одним кліком',
        buttonExporting: 'Експорт...',
        buttonSucceed: 'Експорт успішно',
        buttonFailed: 'Експорт не вдалося',
        download: 'Завантажити',
        description: 'Ми підтримуємо експорт даних веб-сайту, щоб забезпечити надійне резервне копіювання, зручну міграцію, глибокий аналіз і відповідність вимогам, а також повний контроль і прозорість ваших даних.',
        tip: 'Експорт даних у файл CSV.',
      },
      theme: {
        title: 'Тема',
        tip: 'Виберіть тему для вашого веб-інтерфейсу CodeTime.',
        dark: 'Темна',
        light: 'Світла',
        system: 'Система',
      },
      dangerZone: {
        title: 'Небезпечна зона',
        description: 'Ці налаштування назавжди вплинуть на ваші дані і не можуть бути скасовані. Будь ласка, дійте обережно.',
        button: {
          removeAllData: 'Видалити всі дані',
          modal: {
            p1: 'Ви дійсно хочете видалити всі ваші дані? Ця операція не може бути скасована.',
            p2: 'Ваші дані дуже важливі. Ви можете спочатку експортувати дані, а потім видалити їх.',
            p3: 'Якщо ви хочете видалити всі дані, введіть DELETE нижче, а потім натисніть кнопку Підтвердити.',
          },
        },
      },
      account: {
        title: 'Обліковий запис',
        description: 'Налаштування облікового запису.',
        expiresIn: 'Термін дії закінчується',
        manageSubscription: 'Керуйте підпискою',
        subscribe: 'Підписатися',
      },
      other: {
        title: 'Інше',
        description: 'Інші налаштування.',
        logout: 'Вийти',
      },
    },
    leaderboard: {
      title(days: number) {
        return `Рейтинг часу кодування за останні ${days} днів`
      },
      delta(string: string) {
        return `${string} позаду`
      },
    },
  },
  button: {
    copy: 'Копіювати',
    copied: 'Скопійовано',
  },
  plot: {
    label: {
      project: 'Проект',
      timeHour: 'Час (години)',
      language: 'Мова',
      date: 'Дата',
      duration: 'Тривалість',
      other: 'Інше',
      unknown: 'Невідомо',
    },
  },
}
